index.org
#+TITLE: go100
#+AUTHOR: wlianfu
#+DATE: 2023
#+EMAIL: wlianfu@163.com
#+OPTIONS: go100

-----

***** 关键字

| break    | default     | func   | interface | select |
|----------+-------------+--------+-----------+--------|
| case     | defer       | go     | map       | struct |
| chan     | else        | goto   | package   | switch |
| const    | fallthrough | if     | range     | type   |
| continue | for         | import | return    | var    |

***** 预定义关键字

#+BEGIN_SRC
内建常量：true false iota nil

内建类型：int int8 int16 int32 int64
  uint unit8 unit16 unit32 unit64 uintptr
  float32 float64 complex128 complex64
  bool byte rune string error

内建函数：make len cap new append copy close delete
  complex real imag
  panic recover
#+END_SRC

***** 字符

#+BEGIN_SRC
Go 语言字符有两种:
+ unit8类型，或者叫byte类型，代表一个ASCII码字符。
+ rune类型，等价于int32类型，代表一个UTF-8字符。
#+END_SRC

#+BEGIN_SRC
Unicode 包中内置了一些用于测试字符的函数，这些函数的返回值都是一个布尔值:
+ 判断是否为字母：unicode.IsLetter(ch)
+ 判断是否为数字：unicode.IsDigit(ch)
+ 判断是否为空白符号：unicode.IsSpace(ch)
#+END_SRC

+ 中文每个字符占用 3 个字节。

***** 字符串格式化

| 功能 | 解释                                   |
|------+----------------------------------------|
| %v   | 按本值输出                             |
| %+v  | 在%v基础上，对结构体字段名和值进行展开 |
| %#v  | 输出Go语言语法格式的值                 |
| %T   | 输出Go语言语法格式的类型和值           |
| %%   | 输出 % 本体                            |
| %b   | 整型以二进制方式显示                   |
| %o   | 整型以八进制方式显示                   |
| %d   | 整型以十进制方式显示                   |
| %x   | 整型以十六进制方式显示                 |
| %X   | 整型以十六进制、字母大写方式显示       |
| %U   | Unicode 字符                           |
| %f   | 浮点数                                 |
| %p   | 指针，十六进制方式显示                 |

***** 学习资料

+ [[https://gobyexample.com/][Go by Example]]
+ [[http://c.biancheng.net/golang/][Go语言入门教程]]
+ [[https://learnku.com/docs/the-way-to-go][《The Way to Go》中文译本]]
+ [[https://learnku.com/go/docs][Go社区文档]]
+ [[https://learn.microsoft.com/zh-cn/training/paths/go-first-steps/][Microsoft Go学习]]
+ [[https://geekr.dev/golang-tutorial][Go 入门到精通教程]]
+ [[https://www.topgoer.cn/][地鼠文档]]

***** 其它

+ [[https://github.com/golang/go/wiki/GoUsers][Go Users]]

-----
