index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-04 Tue 16:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>go100</title>
<meta name="author" content="wlianfu" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">go100</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9dff6b8">1. 关键字</a></li>
<li><a href="#org63569d3">2. 预定义关键字</a></li>
<li><a href="#org5fb3f66">3. 字符</a></li>
<li><a href="#org68ce013">4. 字符串格式化</a></li>
<li><a href="#orgf7701f9">5. 学习资料</a></li>
<li><a href="#orge1ce7d2">6. 其它</a></li>
</ul>
</div>
</div>
<hr />

<div id="outline-container-org9dff6b8" class="outline-2">
<h2 id="org9dff6b8"><span class="section-number-2">1.</span> 关键字</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">break</th>
<th scope="col" class="org-left">default</th>
<th scope="col" class="org-left">func</th>
<th scope="col" class="org-left">interface</th>
<th scope="col" class="org-left">select</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">case</td>
<td class="org-left">defer</td>
<td class="org-left">go</td>
<td class="org-left">map</td>
<td class="org-left">struct</td>
</tr>

<tr>
<td class="org-left">chan</td>
<td class="org-left">else</td>
<td class="org-left">goto</td>
<td class="org-left">package</td>
<td class="org-left">switch</td>
</tr>

<tr>
<td class="org-left">const</td>
<td class="org-left">fallthrough</td>
<td class="org-left">if</td>
<td class="org-left">range</td>
<td class="org-left">type</td>
</tr>

<tr>
<td class="org-left">continue</td>
<td class="org-left">for</td>
<td class="org-left">import</td>
<td class="org-left">return</td>
<td class="org-left">var</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org63569d3" class="outline-2">
<h2 id="org63569d3"><span class="section-number-2">2.</span> 预定义关键字</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
内建常量：true false iota nil

内建类型：int int8 int16 int32 int64
  uint unit8 unit16 unit32 unit64 uintptr
  float32 float64 complex128 complex64
  bool byte rune string error

内建函数：make len cap new append copy close delete
  complex real imag
  panic recover
</pre>
</div>
</div>

<div id="outline-container-org5fb3f66" class="outline-2">
<h2 id="org5fb3f66"><span class="section-number-2">3.</span> 字符</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
Go 语言字符有两种:
+ unit8类型，或者叫byte类型，代表一个ASCII码字符。
+ rune类型，等价于int32类型，代表一个UTF-8字符。
</pre>

<pre class="example">
Unicode 包中内置了一些用于测试字符的函数，这些函数的返回值都是一个布尔值:
+ 判断是否为字母：unicode.IsLetter(ch)
+ 判断是否为数字：unicode.IsDigit(ch)
+ 判断是否为空白符号：unicode.IsSpace(ch)
</pre>

<ul class="org-ul">
<li>中文每个字符占用 3 个字节。</li>
</ul>
</div>
</div>

<div id="outline-container-org68ce013" class="outline-2">
<h2 id="org68ce013"><span class="section-number-2">4.</span> 字符串格式化</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">解释</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">%v</td>
<td class="org-left">按本值输出</td>
</tr>

<tr>
<td class="org-left">%+v</td>
<td class="org-left">在%v基础上，对结构体字段名和值进行展开</td>
</tr>

<tr>
<td class="org-left">%#v</td>
<td class="org-left">输出Go语言语法格式的值</td>
</tr>

<tr>
<td class="org-left">%T</td>
<td class="org-left">输出Go语言语法格式的类型和值</td>
</tr>

<tr>
<td class="org-left">%%</td>
<td class="org-left">输出 % 本体</td>
</tr>

<tr>
<td class="org-left">%b</td>
<td class="org-left">整型以二进制方式显示</td>
</tr>

<tr>
<td class="org-left">%o</td>
<td class="org-left">整型以八进制方式显示</td>
</tr>

<tr>
<td class="org-left">%d</td>
<td class="org-left">整型以十进制方式显示</td>
</tr>

<tr>
<td class="org-left">%x</td>
<td class="org-left">整型以十六进制方式显示</td>
</tr>

<tr>
<td class="org-left">%X</td>
<td class="org-left">整型以十六进制、字母大写方式显示</td>
</tr>

<tr>
<td class="org-left">%U</td>
<td class="org-left">Unicode 字符</td>
</tr>

<tr>
<td class="org-left">%f</td>
<td class="org-left">浮点数</td>
</tr>

<tr>
<td class="org-left">%p</td>
<td class="org-left">指针，十六进制方式显示</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf7701f9" class="outline-2">
<h2 id="orgf7701f9"><span class="section-number-2">5.</span> 学习资料</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://gobyexample.com/">Go by Example</a></li>
<li><a href="http://c.biancheng.net/golang/">Go语言入门教程</a></li>
<li><a href="https://learnku.com/docs/the-way-to-go">《The Way to Go》中文译本</a></li>
<li><a href="https://learnku.com/go/docs">Go社区文档</a></li>
<li><a href="https://learn.microsoft.com/zh-cn/training/paths/go-first-steps/">Microsoft Go学习</a></li>
<li><a href="https://geekr.dev/golang-tutorial">Go 入门到精通教程</a></li>
<li><a href="https://www.topgoer.cn/">地鼠文档</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge1ce7d2" class="outline-2">
<h2 id="orge1ce7d2"><span class="section-number-2">6.</span> 其它</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="https://github.com/golang/go/wiki/GoUsers">Go Users</a></li>
</ul>

<hr />
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023</p>
<p class="author">Author: wlianfu</p>
<p class="date">Created: 2023-04-04 Tue 16:07</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
